    # Крок 1: Обираємо ОС. 
# Для DevOps важливо брати "alpine" — це супер-маленький Linux (всього 5МБ).
FROM node:20-alpine

# Крок 2: Створюємо папку під проект
WORKDIR /usr/src/app

# Крок 3: Копіюємо тільки списки бібліотек
COPY package*.json ./

# Крок 4: Встановлюємо залежності
# Як DevOps, ти маєш знати: цей крок кешується. Якщо код змінився, а бібліотеки ні — 
# Docker пропустить цей крок і зекономить час на CI/CD.
RUN npm install

# Крок 5: Копіюємо решту коду
COPY . .

# Крок 6: Документуємо порт
EXPOSE 3000

# Крок 7: Запуск
CMD ["npm", "run", "dev"]